trade_exp/src/Catalogs/МаркетинговыеМероприятия/МаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>МаркетинговыеМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c73091d4-df84-416b-b922-292bad652bcb">
    <name>ВидАкции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ae9479-c571-4679-84b4-7b266d558aa3">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc28c861-b1f1-4634-9c0b-44ce86962cc5">
    <name>СегментПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08fbba43-8d05-4b08-9fdc-4b1752590134">
    <name>Завершено</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15a17d46-90e2-4b4f-aff8-97f6003b84e9">
    <name>ПлановаяДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="85ac9f24-3837-4782-a585-56a0d879b1e6">
    <name>ПлановаяДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="39107d04-fe7d-4b1d-89e3-dd5ab7328e09">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7e3491f-fa5c-4f9b-845d-3fc9d2e74e76">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37ce1685-dc81-4c83-8c8d-41c951b3174f">
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1646f0d-1858-4e3b-aeba-44c3c6abc7a4">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c67c05fb-234f-4b67-bb6c-3d22c4fd239b">
    <name>Алгоритм</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d833614f-4c8d-4905-aff5-99423da2d475">
    <name>Промокод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75a918bd-beee-43f3-a18d-0d1f5a06d59b">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfc3f2b2-ba4e-4175-baa3-51b75736bf1b">
    <name>ТипОтбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee72e673-d0fa-4062-b4db-48866b97ec94">
    <name>БюджетАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47182116-8c5d-43df-9acd-c16a17e02949">
    <name>ТипОтбораПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="b1aa65f9-8969-4429-82be-1d3696361de3">
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0df12fc9-5869-4c64-892b-69872209a792">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04054850-afc8-46e1-8838-58b9a799d9f3">
      <name>РольПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="357743e8-165c-4eeb-918c-ee282061e1d4">
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d602f20-0a08-45e4-9ea8-d3509b5ffcad">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4662048c-988b-40e1-9c1b-d22e9a883984">
    <name>ТоварыАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9b9b5f85-9670-470a-9686-c6df882241af">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c59564d8-df31-4aa6-b19d-2fff746be329">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1239bbd5-f2e0-4cd4-a620-0d3528a66025">
      <name>Процент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9e1db591-e524-4dd2-8d94-7f801ba78ebb">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="77141400-a5cb-47a5-a8cc-d87a803174d7">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00659616-12e6-49ba-ac39-a7e437c8d9a9">
      <name>ГруппаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7e74afc2-2a2b-4a56-a6a4-35b421968295">
    <name>Действия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="aafec904-8da8-4417-8eda-c15e474197a7">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d62d74a0-fa15-4567-ad4a-bd1b6e299029">
    <name>ПартнерыАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9ed678a6-0e10-4705-89e4-699d8b6c84fd">
      <name>СегментПартнеров</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09e18e44-8c22-4194-9df6-0805c09c69cb">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d55e3f2b-4f2f-4a72-9410-92dbffff7e08">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="61ab45fc-991f-464a-815e-f62615097e77">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2a4dea56-afad-464b-9da1-6c1850af97a4">
    <name>Подразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91264b70-5b30-44c8-8b78-9db5998692ce">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/СтатусыПартнеровВПрограммеЛояльности_Альтерра/СтатусыПартнеровВПрограммеЛояльности_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4800be07-b74e-45d9-83ee-9b740463b7f0">
  <name>СтатусыПартнеровВПрограммеЛояльности_Альтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="bfe880f2-2a83-40a2-a158-a0f2d42f161c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="1f84bef1-2672-42f1-b0e6-a423f2692fb4">
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c4f8fdda-814a-4f15-a3f5-667b1d927020">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ПартнерыСегмента/ПартнерыСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПартнерыСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыДействияМаркетинговыхМероприятий/ТипыДействияМаркетинговыхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d1a99da-ba46-4dee-b77e-6acdaf25f112">
  <name>ТипыДействияМаркетинговыхМероприятий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5eafd854-5f16-4357-b069-5d7c4f969104">
    <name>СменитьСтатусУчастникаБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d3289f14-5ea3-47b6-a253-33b0f697d00f">
    <name>НачислитьБонусыСуммой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be142fa8-0902-4895-8dbc-f1ab2a79bed7">
    <name>УстановитьВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="375c2168-afdc-4f60-9d65-471130e7ffb4">
    <name>НачислитьБонусыПроцентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЗаказовНаДоставку/СтатусыЗаказовНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="001dd93b-cd26-4b28-8ae1-9d7129bc2202">
  <name>СтатусыЗаказовНаДоставку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1367a921-0ba4-4d75-8d60-7c37522518c2">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипОтбора/ТипОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0f33bed1-a59c-4bbd-aa97-b0e0b4cb5aef">
  <name>ТипОтбора</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b767e370-4bf6-4bd1-8775-1a5489e860cd">
    <name>ПоСписку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7ad25d3f-0b4a-44db-8fb1-24a4bae7c7c3">
    <name>ПоСегменту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="764f86b6-2f54-40c0-8cc4-24a1b9567c35">
    <name>ПоВсемЭлементам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/МаркетинговыеМероприятия/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Акции

Процедура РасчетПоМаркетинговымМероприятиям(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ЭтоЗаказ = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента"),Истина,Ложь);
	РеализацияПоЗаказу = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") И ЗначениеЗаполнено(Объект.ЗаказКлиента),Истина,Ложь);
	
	НовыйПорядокНачисления = БонусыАльтерраРезерв.ПрименитьНовыйПорядокРаспределенияБонусов(Объект);
	
	ДокДата = ?(НовыйПорядокНачисления И ЭтоЗаказ, Объект.ДатаСоздания, Объект.Дата);
	ДокДата = ?(НовыйПорядокНачисления И РеализацияПоЗаказу И ЗначениеЗаполнено(Объект.ЗаказКлиента), Объект.ЗаказКлиента.ДатаСоздания, Объект.Дата);
	 
	Если ПолучитьВсеДействующиеМероприятия(ДокДата).Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    //Очищение таблицы по акциям
	Объект.Акции.Очистить();

	ТаблицаПримененныхАкций = Новый ТаблицаЗначений();
	ТаблицаПримененныхАкций.Колонки.Добавить("МаркетинговоеМероприятие");
	ТаблицаПримененныхАкций.Колонки.Добавить("Действие");
	ТаблицаПримененныхАкций.Колонки.Добавить("Баллы");
	ТаблицаПримененныхАкций.Колонки.Добавить("НеПрименено");
	
	//Проверка по алгоритмам
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") Тогда 
		
		Если Не ЗаказНаДоставкуПодходитПодУсловия(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(Объект.Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
			Если Не БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;  
		
		АкцииНаДоставку = ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаДоставку,Объект.Подразделение,ДокДата);
		
		//Проверяем подходит ли заказ под условия и существуют ли мероприятия с типом алгоритма "За доставку"
		Если АкцииНаДоставку.Количество()>0 Тогда
			ТЗНоменклатуры = ПолучитьНоменклатуруДляРасчета(Объект.Основания.Выгрузить(,"Документ"));
			СтруктураДействийИМероприятий = ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Объект.Партнер,ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура"),АкцииНаДоставку,ТаблицаПримененныхАкций);
			ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		МожноНачислитьБонусы = Не ЕстьЗапретНаБонусы(Объект,,НовыйПорядокНачисления);
		
		АкцииЗаТовар = ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаТовар,Объект.Подразделение,ДокДата);  
		
		ТЗНоменклатуры = БонусыАльтерраРезерв.ПолучитьТоварыКРасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата, Истина);  
		МассивНоменклатуры = ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура");
		ТЗНоменклатурыБезБонусов = БонусыАльтерраРезерв.ПолучитьТоварыКРасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата, Ложь);
		МассивНоменклатурыБезБонусов = ТЗНоменклатурыБезБонусов.ВыгрузитьКолонку("Номенклатура");
		
		//Проверяем существуют ли мероприятия с типом алгоритма "За товар"
		Если АкцииЗаТовар.Количество() > 0 Тогда
			СтруктураДействийИМероприятий = ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Объект.Партнер, МассивНоменклатуры, АкцииЗаТовар,ТаблицаПримененныхАкций);
			ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
		КонецЕсли;
		
		АкцииЗаПромокод = ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаПромокод,Объект.Подразделение,ДокДата);
		
		//Проверяем существуют ли мероприятия с типом алгоритма "За промокод"
		Если АкцииЗаПромокод.Количество() > 0 Тогда  
			
			Если МожноНачислитьБонусы Тогда 
			
				Если ЗначениеЗаполнено(Объект.Промокод) Тогда
					
					МероприятияПоОтборуПромокод = ПолучитьМероприятияПоОтборуПромокод(Объект.Промокод,Объект.Подразделение,ДокДата);
					
					Для каждого СтрокаМероприятие из МероприятияПоОтборуПромокод Цикл
						
						Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
							
							НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
							НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
							НоваяСтрока.Действие = СтрокаДействие.Действие;
							
						КонецЦикла;	
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.ПривелКлиент) Тогда
					
					СтруктураДействийИМероприятий = ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Объект.ПривелКлиент, МассивНоменклатуры, АкцииЗаПромокод,ТаблицаПримененныхАкций,Истина);
					
					Если СтруктураДействийИМероприятий.ТаблицаПримененныхАкций.Количество()>0 Тогда
						ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЕсли;
	
	//Выполнение действий
	Если ТаблицаПримененныхАкций.Количество() > 0 Тогда
		
		ПересчитатьБонусныеБаллы = Ложь;
		СтатусИзменен = Ложь;       
		РассчитатьСкидкиНаценки = Ложь;   
		СтрокиСРеализацией = Новый Массив;
		
		
		Для каждого СтрокаТаблицы из ТаблицаПримененныхАкций Цикл
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.УстановитьВидЦены Тогда     
				
				Если Не ЕстьЗапретНаБонусы(Объект, Истина, НовыйПорядокНачисления) Тогда 
				
					ПересчитатьБонусныеБаллы = Ложь;
					
					Для Каждого СтрокаТовар Из ТЗНоменклатуры Цикл
						
						НовыйВидЦены = Справочники.МаркетинговыеМероприятия.ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТовар.Номенклатура,СтрокаТовар.Характеристика,СтрокаТаблицы.Действие);		
						
						Если ЗначениеЗаполнено(НовыйВидЦены) Тогда
							
							НоваяЦена = АльтерраОбщегоНазначения.ПолучитьЦену(СтрокаТовар.Номенклатура, НовыйВидЦены);
							
							НайденнаяСтрока = Объект.Товары[СтрокаТовар.НомерСтроки-1];
							
							Если НоваяЦена < НайденнаяСтрока.Цена Тогда  
								НайденнаяСтрока.ВидЦены = НовыйВидЦены;
								НайденнаяСтрока.Цена = НоваяЦена;					
								АльтерраОбщегоНазначения.ПересчитатьСуммыВСтрокеТовара(Объект, НайденнаяСтрока);
								
								НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма - НайденнаяСтрока.СуммаБонусныхБалловКСписанию;
								НайденнаяСтрока.СуммаСНДС = НайденнаяСтрока.СуммаСНДС - НайденнаяСтрока.СуммаБонусныхБалловКСписанию;

								Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
									Объект.ПричинаОтклоненияОтЦеновыхУсловий = Объект.ПричинаОтклоненияОтЦеновыхУсловий + " Акция: " + СтрокаТаблицы.МаркетинговоеМероприятие.Наименование + " - Строка №" + Строка(СтрокаТовар.НомерСтроки) + " " ;
								КонецЕсли;
								
								ПересчитатьБонусныеБаллы = Истина; 
								РассчитатьСкидкиНаценки = Истина;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					СтрокаТаблицы.НеПрименено = Истина;	
				КонецЕсли;
							
			КонецЕсли;
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.СменитьСтатусУчастникаБонуснойПрограммы Тогда 
				
				Если МожноНачислитьБонусы Тогда
				
					СтарыйСтатус = Объект.СтатусПартнераВПрограммеЛояльности;
					НовыйСтатус = СтрокаТаблицы.Действие.СтатусУчастникаБонуснойПрограммы;
					
					Если НовыйСтатус.Коэффициент > СтарыйСтатус.Коэффициент Тогда    
					
						БонусыАльтерра.ОбновитьСтатусВРегистре(Объект.Партнер,НовыйСтатус);
						СтатусИзменен = Истина;
						
						Если Не ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") Тогда 
							
							ПересчитатьБонусныеБаллы = Истина;
							
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					СтрокаТаблицы.НеПрименено = Истина;				
				КонецЕсли
				
			КонецЕсли;
				
		КонецЦикла;

		Если ПересчитатьБонусныеБаллы Тогда
			БонусыАльтерраРезерв.НачислитьБонусныеБаллы(Объект);
		КонецЕсли;
		
		Если РассчитатьСкидкиНаценки Тогда
			РассчитатьСкидкиНаценкиВДокументе(Объект);
		КонецЕсли;
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") Тогда
			ДокументОплачен = Истина;
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ДокументОплачен = Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит;
		Иначе
			ДокументОплачен = ЗначениеЗаполнено(Объект.Кассир);
		Конецесли;
		
		Если Не ДокументОплачен И СтатусИзменен Тогда
			
			Набор = РегистрыСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(ТекущаяДата());
			Набор.Отбор.БонуснаяПрограммаЛояльности.Установить(Справочники.БонусныеПрограммыЛояльности.НайтиПоНаименованию("Бонус от ALTERRA", Истина));
			Набор.Отбор.Партнер.Установить(Объект.Партнер);
			Набор.Записать();
			
		КонецЕсли;
		
		СуммаББПрочее = 0;
		
		Для каждого СтрокаТаблицы из ТаблицаПримененныхАкций Цикл
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом Тогда      
				
				Если МожноНачислитьБонусы Тогда
				
					ПримененоНаТовар = Ложь;
				
					СуммаДополнительныхБонусов = 0;
					Для Каждого СтрокаТовар Из ТЗНоменклатуры Цикл			
						
						Если Не СтрокаТовар.БезБонусов Тогда 
							
							ДополнительныйПроцент = 0;
							ДополнительныйПроцент = Справочники.МаркетинговыеМероприятия.ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТовар.Номенклатура,СтрокаТовар.Характеристика,СтрокаТаблицы.Действие);
							Если ДополнительныйПроцент > 0 Тогда
								НайденнаяСтрока = Объект.Товары[СтрокаТовар.НомерСтроки-1];
								СуммаДополнительныхБонусовПоНоменклатуре = Цел(НайденнаяСтрока.Сумма*ДополнительныйПроцент);
								Если НовыйПорядокНачисления Тогда
									НайденнаяСтрока.СуммаНачисленныхБалловПрочее = СуммаДополнительныхБонусовПоНоменклатуре;
									НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте = НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус
																							+ НайденнаяСтрока.СуммаНачисленныхБалловЗаКП
																							+ НайденнаяСтрока.СуммаНачисленныхБалловПрочее;
								Иначе
									НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте = НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте + СуммаДополнительныхБонусовПоНоменклатуре;
								КонецЕсли;
								
								СуммаДополнительныхБонусов = СуммаДополнительныхБонусов + СуммаДополнительныхБонусовПоНоменклатуре;	
								
								ПримененоНаТовар = Истина;	
							КонецЕсли;	
						КонецЕсли;
					КонецЦикла;
					
					СтрокаТаблицы.Баллы = СуммаДополнительныхБонусов;
					СуммаББПрочее = СуммаББПрочее + СуммаДополнительныхБонусов;
					
					Если Не ПримененоНаТовар Тогда 
						СтрокаТаблицы.НеПрименено = Истина;				
					КонецЕсли
				Иначе
					СтрокаТаблицы.НеПрименено = Истина				
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой Тогда 
				
				Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") Тогда
					МассивНоменклатурыБезБонусов = ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура");
				КонецЕсли;
				
				ТЗ = ПолучитьМероприятияПоОтборуНоменклатуры(МассивНоменклатурыБезБонусов, СтрокаТаблицы.МаркетинговоеМероприятие);
				
				Если МожноНачислитьБонусы И (ТЗ.Количество() > 0 ИЛИ СтрокаТаблицы.Действие.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод) Тогда 

					Если ДокументОплачен(Объект, НовыйПорядокНачисления) И Не СозданоНачислениеПоДокументу(Объект.Ссылка,СтрокаТаблицы.МаркетинговоеМероприятие,Справочники.ПричиныНачисленияБонусныхБаллов.ПоАкции) Тогда
						СоздатьНачислениеБонусов(АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму(),Объект.Ссылка,Объект.Партнер,СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТаблицы.Действие.СуммаБонусов,"Начислено по акции на основании документа " + Строка(Объект.Номер) + " от " + Строка(Объект.Дата),Справочники.ПричиныНачисленияБонусныхБаллов.ПоАкции);
					КонецЕсли; 
					
				Иначе
					СтрокаТаблицы.НеПрименено = Истина									
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыЗаНовогоКлиента И ЗначениеЗаполнено(Объект.ПривелКлиент) Тогда
				
				Если МожноНачислитьБонусы Тогда
				
					Если ДокументОплачен(Объект, НовыйПорядокНачисления) И Не СозданоНачислениеПоДокументу(Объект.Ссылка,СтрокаТаблицы.МаркетинговоеМероприятие,Справочники.ПричиныНачисленияБонусныхБаллов.ЗаНовогоКлиента) Тогда
						СоздатьНачислениеБонусов(АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму(),Объект.Ссылка,Объект.ПривелКлиент,СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТаблицы.Действие.СуммаБонусов,"Начислено по акции на основании документа " + Строка(Объект.Номер) + " от " + Строка(Объект.Дата),Справочники.ПричиныНачисленияБонусныхБаллов.ЗаНовогоКлиента);
					КонецЕсли;
					
				Иначе
					СтрокаТаблицы.НеПрименено = Истина				
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЦикла;
		
		Если СуммаББПрочее > 0 Тогда
			
			Если Не НовыйПорядокНачисления Тогда
				НоваяСтрока = Объект.БонусныеБаллы.Добавить();
				НоваяСтрока.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
				НоваяСтрока.ДатаНачисления = НачалоДня(Объект.Дата)+3600*24*3;
				НоваяСтрока.СуммаБонусныхБаллов = СуммаББПрочее;
			Иначе
				Если Объект.БонусныеБаллы.Количество() > 0 Тогда
					НоваяСтрока = Объект.БонусныеБаллы[0];
				Иначе
					НоваяСтрока = Объект.БонусныеБаллы.Добавить();
					НоваяСтрока.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
					НоваяСтрока.ДатаНачисления = НачалоДня(Объект.Дата)+3600*24*3;
				КонецЕсли;
				
				НоваяСтрока.СуммаБонусныхБалловПрочее = СуммаББПрочее; 
				НоваяСтрока.СуммаБонусныхБаллов = НоваяСтрока.СуммаБонусныхБалловЗаСтатус
				+ НоваяСтрока.СуммаБонусныхБалловЗаКП
				+ НоваяСтрока.СуммаБонусныхБалловПрочее;
				
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаАкций = Новый ТаблицаЗначений;
		ПараметрыОтбора = Новый Структура("НеПрименено", Неопределено);
		ТаблицаАкций = ТаблицаПримененныхАкций.Скопировать(ПараметрыОтбора);   
		
		Объект.Акции.Загрузить(ТаблицаАкций);
			
	Иначе
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ЗаказНаДоставкуПодходитПодУсловия(ЗаказНаДоставку) Экспорт
	
	Возврат (ЗаказНаДоставку.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная И
	ЗаказНаДоставку.Статус = Перечисления.СтатусыЗаказовНаДоставку.ВРейсе И ЗаказНаДоставку.Проведен);
	
КонецФункции

Функция ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(АлгоритмАкции,Подразделение,Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка,
		|	МаркетинговыеМероприятияПодразделения.Подразделение КАК Подразделение,
		|	МаркетинговыеМероприятияПодразделения.НомерСтроки КАК НомерСтроки,
		|	МаркетинговыеМероприятия.Алгоритм КАК Алгоритм
		|ПОМЕСТИТЬ ВТ_Мероприятия
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаркетинговыеМероприятия.Подразделения КАК МаркетинговыеМероприятияПодразделения
		|		ПО МаркетинговыеМероприятия.Ссылка = МаркетинговыеМероприятияПодразделения.Ссылка
		|ГДЕ
		|	(МаркетинговыеМероприятияПодразделения.НомерСтроки ЕСТЬ NULL
		|			ИЛИ МаркетинговыеМероприятияПодразделения.Подразделение = &Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Мероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Мероприятия КАК ВТ_Мероприятия
		|ГДЕ
		|	ВТ_Мероприятия.Алгоритм = &Алгоритм
		|	И ВТ_Мероприятия.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Алгоритм", АлгоритмАкции);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", ПолучитьВсеДействующиеМероприятия(Дата));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Возврат РезультатЗапроса; 

КонецФункции

Функция ПолучитьВсеДействующиеМероприятия(ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.ДатаОкончания >= &ДатаДокумента
		|	И МаркетинговыеМероприятия.ДатаНачала <= &ДатаДокумента
		|	И МаркетинговыеМероприятия.ВидАкции = &ВидАкции
		|	И МаркетинговыеМероприятия.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидАкции", Перечисления.ВидыАкций.Алгоритм);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДатаДокумента));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьМероприятияПоАлгоритму(АлгоритмАкции,МассивМероприятий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Алгоритм = &Алгоритм
	    |	И МаркетинговыеМероприятия.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("Алгоритм", АлгоритмАкции);
	Запрос.УстановитьПараметр("МассивСсылок", МассивМероприятий);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПодходитПодУсловияОтбораАлгоритма(АлгоритмАкции,Клиент,ТаблицаТоваров,МассивМероприятий) Экспорт
	
	//СтруктураОтвета = Новый Структура("УсловияВыполняются,МаркетинговыеМероприятия",Ложь,"");
	//
	//МероприятияПоАлгоритму = ПолучитьМероприятияПоАлгоритму(АлгоритмАкции,МассивМероприятий);
	//
	//Если АлгоритмАкции = Перечисления.АлгоритмыАкций.ЗаТовар Тогда
	//	Если МероприятияПоАлгоритму.Количество()>0 Тогда
	//		МероприятияПоПартнеру = ПолучитьМероприятияПоОтборуПартнера(Клиент,МероприятияПоАлгоритму);
	//		Если МероприятияПоПартнеру.Количество()>0 Тогда
	//			МероприятияПоНоменклатуре = ПолучитьМероприятияПоОтборуНоменклатуры(ТаблицаТоваров,МероприятияПоПартнеру);
	//			Если МероприятияПоНоменклатуре.Количество()>0 Тогда
	//				СтруктураОтвета.УсловияВыполняются = Истина;
	//				СтруктураОтвета.МаркетинговыеМероприятия = МероприятияПоНоменклатуре;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

	//Возврат СтруктураОтвета;
КонецФункции

Функция ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Партнер,Товары,МассивМероприятий,ТаблицаПримененныхАкций,ОтборТолькоПоПартнеру = Ложь) Экспорт
	
	МероприятияПоОтборуПартнера = ПолучитьМероприятияПоОтборуПартнера(Партнер,МассивМероприятий);
	//Проверяем подходит ли документ по партнеру из документов оснований
	Если МероприятияПоОтборуПартнера.Количество()>0 Тогда
		
		Если ОтборТолькоПоПартнеру Тогда
			Для каждого СтрокаМероприятие из МероприятияПоОтборуПартнера Цикл
				
				Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
					
					НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
					НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
					НоваяСтрока.Действие = СтрокаДействие.Действие;
										
				КонецЦикла;	
			КонецЦикла;
				
			Иначе
				МероприятияПоОтборуНоменклатуры = ПолучитьМероприятияПоОтборуНоменклатуры(Товары,МероприятияПоОтборуПартнера);
				//Проверяем подходит ли документ по товару из документов оснований	
				Если МероприятияПоОтборуНоменклатуры.Количество()>0 Тогда
					
					Для каждого СтрокаМероприятие из МероприятияПоОтборуНоменклатуры Цикл
						
						Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
							
							НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
							НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
							НоваяСтрока.Действие = СтрокаДействие.Действие;
							
						КонецЦикла;	
						
					КонецЦикла;	
					
				КонецЕсли;
			КонецЕсли;
			
	КонецЕсли;

	Возврат Новый Структура("ТаблицаПримененныхАкций",ТаблицаПримененныхАкций);
	
КонецФункции

Функция ПолучитьМероприятияПоОтборуНоменклатуры(МассивНоменклатуры, МассивМероприятий) Экспорт
	 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.ТипОтбора = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСписку)
		|	И МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		ПО МаркетинговыеМероприятия.СегментНоменклатуры = НоменклатураСегмента.Сегмент
		|ГДЕ
		|	НоменклатураСегмента.Номенклатура В(&Номенклатура)
		|	И МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбора = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСегменту)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбора = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоВсемЭлементам)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка";

	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка", МассивМероприятий);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Акции = Новый ТаблицаЗначений;
	Акции.Колонки.Добавить("Ссылка");
	
	Пока РезультатЗапроса.Следующий() Цикл
		Если РезультатЗапроса.Ссылка.ТипОтбора = Перечисления.ТипОтбора.ПоСписку Тогда
			НоменклатураПоАкцииЕсть = Ложь;
			Для каждого СтрокаТоварыАкции из РезультатЗапроса.Ссылка.ТоварыАкции Цикл
				Если ЗначениеЗаполнено(СтрокаТоварыАкции.Номенклатура) Тогда
					НоменклатураПоАкцииЕсть = Не МассивНоменклатуры.Найти(СтрокаТоварыАкции.Номенклатура) = Неопределено;
				ИначеЕсли ЗначениеЗаполнено(СтрокаТоварыАкции.ВидНоменклатуры) Тогда
					НоменклатураПоАкцииЕсть = СоотвествиеВидуНоменклатуры(МассивНоменклатуры,СтрокаТоварыАкции.ВидНоменклатуры); 
				Иначе
					НоменклатураПоАкцииЕсть = СоотвествиеГруппеНоменклатуры(МассивНоменклатуры,СтрокаТоварыАкции.ГруппаНоменклатуры); 
				КонецЕсли;
				Если НоменклатураПоАкцииЕсть Тогда
					НоваяСтрока = Акции.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НоваяСтрока = Акции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Акции;

КонецФункции

Функция СоотвествиеВидуНоменклатуры(МассивНоменклатуры,ВидНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция СоотвествиеГруппеНоменклатуры(МассивНоменклатуры,ГруппаНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);
		
	Возврат Не Запрос.Выполнить().Пустой();

	
КонецФункции

Функция ПолучитьМероприятияПоОтборуПартнера(Партнер,МассивМероприятий) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыСегмента.Сегмент КАК Сегмент
		|ПОМЕСТИТЬ СегментыПартнера
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Партнер = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбораПартнер = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСегменту)
		|	И ВЫБОР
		|			КОГДА МаркетинговыеМероприятия.Клиент = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|				ТОГДА МаркетинговыеМероприятия.СегментПартнеров В
		|						(ВЫБРАТЬ
		|							СегментыПартнера.Сегмент КАК Ссылка
		|						ИЗ
		|							СегментыПартнера)
		|			ИНАЧЕ МаркетинговыеМероприятия.Клиент = &Клиент
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МаркетинговыеМероприятия.ПартнерыАкции КАК МаркетинговыеМероприятияПартнерыАкции
		|		ПО МаркетинговыеМероприятия.Ссылка = МаркетинговыеМероприятияПартнерыАкции.Ссылка
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбораПартнер = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСписку)
		|	И ВЫБОР
		|			КОГДА НЕ МаркетинговыеМероприятияПартнерыАкции.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|				ТОГДА МаркетинговыеМероприятияПартнерыАкции.СегментПартнеров В
		|						(ВЫБРАТЬ
		|							СегментыПартнера.Сегмент КАК Ссылка
		|						ИЗ
		|							СегментыПартнера)
		|			ИНАЧЕ ВЫБОР
		|					КОГДА НЕ МаркетинговыеМероприятияПартнерыАкции.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|						ТОГДА МаркетинговыеМероприятияПартнерыАкции.Партнер = &Клиент
		|					ИНАЧЕ (МаркетинговыеМероприятияПартнерыАкции.Свойство, МаркетинговыеМероприятияПартнерыАкции.Значение) В
		|							(ВЫБРАТЬ
		|								ПартнерыДополнительныеРеквизиты.Свойство КАК Свойство,
		|								ПартнерыДополнительныеРеквизиты.Значение КАК Значение
		|							ИЗ
		|								Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|							ГДЕ
		|								ПартнерыДополнительныеРеквизиты.Ссылка = &Клиент)
		|				КОНЕЦ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбораПартнер = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоВсемЭлементам)";
	
	Запрос.УстановитьПараметр("Клиент", Партнер);
	Запрос.УстановитьПараметр("Ссылка", МассивМероприятий);
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	

Функция ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(Мероприятие,Номенклатура,Характеристика,Действие) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	ИмяКолонки = "";
	ИмяРеквизита = "";
	
	Если Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом Тогда
		ИмяКолонки = "Процент";
		ЗначениеДействия = Действие.ПроцентБонусов/100;
	ИначеЕсли Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.УстановитьВидЦены Тогда
		ИмяКолонки = "ВидЦены";
		ЗначениеДействия  = Действие.ВидЦены;		
	КонецЕсли;
	
	
	Если Не ПустаяСтрока(ИмяКолонки) Тогда
		
		Если Мероприятие.ТипОтбора = Перечисления.ТипОтбора.ПоСписку Тогда
			
			Для каждого СтрокаТовары из Мероприятие.ТоварыАкции Цикл
				
				НоменклатураПоАкцииЕсть = Ложь;
				
				Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
					НоменклатураПоАкцииЕсть = СтрокаТовары.Номенклатура = Номенклатура;	
				ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.ВидНоменклатуры) Тогда
					НоменклатураПоАкцииЕсть = СтрокаТовары.ВидНоменклатуры = Номенклатура.ВидНоменклатуры; 
				Иначе
					МассивНоменклатуры = Новый Массив;
					МассивНоменклатуры.Добавить(Номенклатура);
					НоменклатураПоАкцииЕсть = СоотвествиеГруппеНоменклатуры(МассивНоменклатуры,СтрокаТовары.ГруппаНоменклатуры); 
				КонецЕсли;	
				
				Если НоменклатураПоАкцииЕсть Тогда
					
					Если ТипЗнч(СтрокаТовары[ИмяКолонки]) = Тип("Число") Тогда
						ВозвращаемоеЗначение = ?(СтрокаТовары[ИмяКолонки]>0,СтрокаТовары[ИмяКолонки]/100,ЗначениеДействия);
					Иначе
						ВозвращаемоеЗначение = ?(ЗначениеЗаполнено(СтрокаТовары[ИмяКолонки]),СтрокаТовары[ИмяКолонки],ЗначениеДействия);
					КонецЕсли;
					Прервать; 
					
				Иначе
					
					Если ТипЗнч(СтрокаТовары[ИмяКолонки]) = Тип("Число") Тогда
						ВозвращаемоеЗначение = 0;
					Иначе
						ВозвращаемоеЗначение = "";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Мероприятие.ТипОтбора = Перечисления.ТипОтбора.ПоСегменту Тогда
			Если ЗначениеЗаполнено(Мероприятие.СегментНоменклатуры) Тогда
				ДинамическийСегмент = Мероприятие.СегментНоменклатуры.СпособФормирования=Перечисления.СпособыФормированияСегментов.ФормироватьДинамически;
				Если СегментыСервер.ВходитВСегмент(Номенклатура,Мероприятие.СегментНоменклатуры,Характеристика,ДинамическийСегмент) Тогда
					ВозвращаемоеЗначение = ЗначениеДействия;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВозвращаемоеЗначение =ЗначениеДействия;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьМероприятияПоОтборуПромокод(Промокод,Подразделение,ДатаДокумента=Неопределено) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка,
		|	МаркетинговыеМероприятияПодразделения.Подразделение КАК Подразделение,
		|	МаркетинговыеМероприятияПодразделения.НомерСтроки КАК НомерСтроки,
		|	МаркетинговыеМероприятия.Алгоритм КАК Алгоритм,
		|	МаркетинговыеМероприятия.Промокод КАК Промокод
		|ПОМЕСТИТЬ ВТ_Мероприятия
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаркетинговыеМероприятия.Подразделения КАК МаркетинговыеМероприятияПодразделения
		|		ПО МаркетинговыеМероприятия.Ссылка = МаркетинговыеМероприятияПодразделения.Ссылка
		|ГДЕ
		|	(МаркетинговыеМероприятияПодразделения.НомерСтроки ЕСТЬ NULL
		|			ИЛИ МаркетинговыеМероприятияПодразделения.Подразделение = &Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Мероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Мероприятия КАК ВТ_Мероприятия
		|ГДЕ
		|	ВТ_Мероприятия.Алгоритм = &Алгоритм
		|	И ВТ_Мероприятия.Ссылка В(&Ссылка)
		|	И ВТ_Мероприятия.Промокод = &Промокод";
	
	Запрос.УстановитьПараметр("Промокод", Промокод);
	Запрос.УстановитьПараметр("Алгоритм", Перечисления.АлгоритмыАкций.ЗаПромокод);
	Запрос.УстановитьПараметр("Ссылка", ПолучитьВсеДействующиеМероприятия(?(ДатаДокумента=Неопределено,ТекущаяДата(),ДатаДокумента)));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат РезультатЗапроса;
	
КонецФункции

Процедура СоздатьНачислениеБонусов(БонуснаяПрограммаЛояльности,Документ,Партнер,МаркетинговоеМероприятие,СуммаБонусов,Комментарий,Причина) Экспорт
	
	ДокументНачислениеСписаниеБонусовОбъект = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	ДокументНачислениеСписаниеБонусовОбъект.Дата = ТекущаяДата();
	ДокументНачислениеСписаниеБонусовОбъект.МаркетинговоеМероприятие = МаркетинговоеМероприятие;
	ДокументНачислениеСписаниеБонусовОбъект.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
	ДокументНачислениеСписаниеБонусовОбъект.Комментарий = Комментарий;
    ДокументНачислениеСписаниеБонусовОбъект.Причина = Причина;
	ДокументНачислениеСписаниеБонусовОбъект.Документ = Документ;
    ДокументНачислениеСписаниеБонусовОбъект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление;
	ДокументНачислениеСписаниеБонусовОбъект.Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Исполнен;
    НоваяСтрокаНачисления = ДокументНачислениеСписаниеБонусовОбъект.Начисление.Добавить();
	НоваяСтрокаНачисления.Партнер = Партнер;
	НоваяСтрокаНачисления.Баллы = СуммаБонусов; 
    ДокументНачислениеСписаниеБонусовОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СозданоНачислениеПоДокументу(Документ,МаркетинговоеМероприятие,Причина) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Основания
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Заказ.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаДоставкуКлиенту.Ссылка
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
		|ГДЕ
		|	ЗаказНаДоставкуКлиенту.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.ЗаказКлиента = Заказ.Ссылка)
		|			И (РеализацияТоваровУслуг.Проведен = ИСТИНА)
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьДокумент
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеИСписаниеБонусныхБаллов КАК НачислениеИСписаниеБонусныхБаллов
		|		ПО (ВТ_Основания.Ссылка = НачислениеИСписаниеБонусныхБаллов.Документ)
		|ГДЕ
		|	НачислениеИСписаниеБонусныхБаллов.Проведен = ИСТИНА
		|	И НачислениеИСписаниеБонусныхБаллов.МаркетинговоеМероприятие = &МаркетинговоеМероприятие
		|	И НачислениеИСписаниеБонусныхБаллов.Причина = &Причина";

	
	Запрос.УстановитьПараметр("МаркетинговоеМероприятие", МаркетинговоеМероприятие);
	Запрос.УстановитьПараметр("Причина", Причина);
	Запрос.УстановитьПараметр("Ссылка", Документ);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьНоменклатуруДляРасчета(МассивОснований) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&Ссылка)
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЗаказКлиентаТовары.Номенклатура В ИЕРАРХИИ (&ГрТара)
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.НомерСтроки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В(&Ссылка)
		|	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ РеализацияТоваровУслугТовары.Номенклатура В ИЕРАРХИИ (&ГрТара)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.НомерСтроки
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка В(&Ссылка)
		|	И ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&ГрТара)";
	
	Запрос.УстановитьПараметр("ГрТара", Справочники.Номенклатура.НайтиПоКоду("00448      "));
	Запрос.УстановитьПараметр("Ссылка", МассивОснований);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ДокументОплачен(Объект, НовыйПорядокНачисления = Ложь) Экспорт
	
	//Если  Тогда
	//	Если НовыйПорядокНачисления И БонусыАльтерраРезерв.ПолучитьСтрокиИзРеализацийПоЗаказу(Объект.Ссылка).Выгрузить().Количество() > 0 Тогда
	//		Отбор = Новый Структура("ДокументОтгрузки", Объект.Ссылка);
	//		ТаблицаОстатков = РегистрыНакопления.ТоварыКОтгрузке.Остатки(,Отбор);
	//		Возврат ТаблицаОстатков.Количество() = 0; 
	//	Иначе
	//		Возврат ЗначениеЗаполнено(Объект.Кассир);
	//	КонецЕсли;
	//Иначе
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат ЗначениеЗаполнено(Объект.Кассир);
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ") Тогда
		Возврат Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЕстьЗапретНаБонусы(Объект, РазрешитьЮЛ = Ложь, НовыйПорядокНачисления = Ложь);    
	
	Запрет = Ложь;
	Если Не БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер, РазрешитьЮЛ) Тогда
		Запрет = Истина;
	КонецЕсли;
	Если НовыйПорядокНачисления Тогда
		Если БонусыАльтерраРезерв.ПроверитьЗапретБонусов(Объект, РазрешитьЮЛ, Ложь) Тогда
			Запрет = Истина;
		КонецЕсли;
	Иначе
		Если БонусыАльтерра.ПроверитьЗапретБонусов(Объект, РазрешитьЮЛ) Тогда
			Запрет = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрет;
КонецФункции

Функция РассчитатьСкидкиНаценкиВДокументе(Объект) 
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Объект, "РеализацияПоЗаказам") Тогда
		СтруктураПараметры.Вставить("РеализацияСверхЗаказа", Объект.РеализацияПоЗаказам)
	КонецЕсли;

	ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	Объект.СкидкиРассчитаны = Истина;    
	
	Если  ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		Объект.ЭтапыГрафикаОплаты.Очистить();
		ВзаимоРасчетыСервер.ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект); 
	КонецЕсли;
КонецФункции
#КонецОбласти

#КонецЕсли
